Autodesk.Revit.DB.RectangularGridSegmentOrientation
The orientation type of rectangular grid segment.
Since:
2012

Autodesk.Revit.DB.RectangularGridSegmentOrientation.Horizontal
A horizontal GridSegment

Autodesk.Revit.DB.RectangularGridSegmentOrientation.Vertical
A vertical GridSegment